Revit 2027 API
BendingDetailFor3DShapesOptions Enumeration
 Describes how the Bending Detail will be represented for 3D shapes.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailFor3DShapesOptions
Public Enumeration BendingDetailFor3DShapesOptions
public enum class BendingDetailFor3DShapesOptions
type BendingDetailFor3DShapesOptions
Members
Member name | Value | Description
IsometricView | 0 |  The bending detail will represent the bar as in an isometric view.
PlanView | 1 |  The bending detail will represent the bar as in a plan view where the view plane is parallel with bar plane.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace